app/views/microposts/show.html.erb

  <strong>User:</strong>
  <%= @micropost.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]